tap "heroku/brew"
tap "opencode-ai/tap"
tap "oven-sh/bun"
tap "sst/tap"
tap "stripe/stripe-cli"

# Compression
brew "xz"
brew "zstd"
brew "zlib"

# Core CLI tools
brew "bat"                    # cat with syntax highlighting
brew "btop"                   # resource monitor
brew "fd"                     # find alternative
brew "ripgrep"                # grep alternative
brew "the_silver_searcher"    # ag
brew "tree"                   # directory tree
brew "htop"                   # process viewer
brew "hyperfine"              # benchmarking

# Shell & prompt
brew "nushell"
brew "starship"
brew "zoxide"
brew "tmux"

# Editors
brew "neovim"
brew "helix"

# Git tools
brew "gh"                     # GitHub CLI
brew "git-delta"              # diff pager
brew "git-filter-repo"        # history rewriting
brew "git-quick-stats"        # git stats
brew "jj"                     # jujutsu VCS
brew "lazygit"                # git TUI

# Languages & runtimes
brew "deno"
brew "node"
brew "fnm"                    # Node version manager
brew "openjdk"
brew "jenv"                   # Java version manager
brew "pyenv"
brew "pyenv-virtualenv"
brew "zig"

# JavaScript ecosystem
brew "pnpm"
brew "yarn"
brew "oven-sh/bun/bun"

# Cloud & deployment
brew "awscli"
brew "flyctl"
brew "heroku/brew/heroku"
brew "stripe/stripe-cli/stripe"
brew "tailscale"

# Containers
brew "colima"
brew "docker", link: false
brew "docker-machine"
brew "podman"

# Build tools & libs
brew "boost"
brew "glib"
brew "luarocks"
brew "watchman"

# Media & graphics
brew "ffmpeg"
brew "graphviz"
brew "tesseract"

# Swift/iOS development
brew "swiftformat"
brew "swiftlint"
brew "swiftplantuml"
brew "xcbeautify"
brew "xcode-build-server"

# AI tools
brew "aider"
brew "sst/tap/opencode"

# Misc utilities
brew "cloc"                   # count lines of code
brew "glow"                   # markdown renderer
brew "just"                   # command runner
brew "lynx"                   # text browser
brew "mkcert"                 # local certs
brew "neofetch"               # system info
brew "nmap"                   # network scanner
brew "pandoc"                 # document converter
brew "sox"                    # audio processing

# GUI Applications
cask "android-platform-tools"
cask "basictex"
cask "dbeaver-community"
cask "font-hack-nerd-font"
cask "ghostty"
cask "github-copilot-for-xcode"
cask "insomnia"
cask "karabiner-elements"
cask "netron"
cask "session-manager-plugin"
cask "yaak"
cask "zoom"

# Cargo packages
cargo "aperture-cli"
cargo "ast-grep"
cargo "cargo-bloat"
cargo "cargo-nextest"
cargo "cargo-release"
cargo "git-cliff"
cargo "nu_plugin_gstat"
cargo "nu_plugin_inc"
cargo "nu_plugin_query"
cargo "pre-commit-rs"
cargo "rustlings"
